Revit 2027 API
CutMarkType.CutMarkSymbolSize Property
 The size of the cut mark symbol.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double CutMarkSymbolSize { get; set; }
Public Property CutMarkSymbolSize As Double
	Get
	Set
public:
property double CutMarkSymbolSize {
	double get ();
	void set (double value);
}
member CutMarkSymbolSize : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for cutMarkSymbolSize must be greater than 0 and no more than 30000 feet.
See Also
Reference
CutMarkType Class
Autodesk.Revit.DB.Architecture Namespace